tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# Core
brew "bash"
brew "zsh"
brew "stow"
brew "vim"
brew "tmux"
brew "reattach-to-user-namespace"
cask "bettertouchtool"

# Filesystem
cask "app-cleaner"
cask "dropbox"
brew "tree"

# Security
cask "1password"

# File Editing
cask "textmate"
cask "visual-studio-code"
cask "qlstephen" # plaintext files, requires additional commands to get working

# Git
brew "git"
brew "git-lfs"
brew "tig"
brew "git-filter-repo"

# Development General
brew "cloc"

# Shell
brew "shellcheck"

# iOS Development
brew "carthage"
brew "swiftlint"
cask "provisionql"
cask "zeplin"

# Android Development
cask "android-studio"

# Docker
brew "docker"
brew "docker-compose"
cask "docker"
cask "kitematic"

# API Development
cask "charles"
cask "insomnia"
cask "intellij-idea-ce"
cask "postico"

# JSON
brew "jq"
cask "quicklook-json"

# Ruby
brew "ruby"
brew "chruby"
brew "ruby-install"

# Python
brew "python"

# Images
brew "imagemagick"
brew "ghostscript"
cask "qlimagesize"

# Video
cask "qlvideo"

# Fonts
cask "font-meslo-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Web Browsers
cask "firefox"
cask "google-chrome"

# Team Communication
cask "slack"
cask "sococo"

# Fun
cask "aerial"
