tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# Core
brew "bash"
brew "zsh"
brew "stow"
brew "vim"
brew "tmux"
brew "reattach-to-user-namespace"

# Git
brew "git"
brew "git-lfs"
brew "tig"

# Helpful
brew "cloc"
brew "tree"

# Shell
brew "shellcheck"
cask "qlstephen" # plaintext files

# iOS Development
brew "carthage"
brew "swiftlint"
cask "provisionql"

# Docker
brew "docker"
brew "docker-compose"
cask "docker"

# API Development
cask "insomnia"

# JSON
brew "jq"
cask "quicklook-json"

# Ruby
brew "ruby"
brew "chruby"
brew "ruby-install"

# Python
brew "python"

# Images
brew "imagemagick"
brew "ghostscript"
cask "qlimagesize"

# Video
cask "qlvideo"

# Fonts
cask "font-meslo-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
