tap 'homebrew/core'
tap "homebrew/cask"
tap 'homebrew/bundle'

# Core
brew 'stow'
brew 'zsh'
brew 'bash'
brew 'coreutils'
brew 'git'
brew 'git-lfs'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'reattach-to-user-namespace'

# General
brew 'cloc'
cask 'qlimagesize'
cask 'qlstephen'

# iOS
brew 'carthage'
cask 'provisionql'
brew 'swiftlint'

# Shell
brew 'shellcheck'

# JSON
brew 'jq'
cask 'quicklook-json'

# Ruby
brew 'ruby'
brew 'chruby'
brew 'ruby-install'

# Python
brew 'python'

# Images
brew 'imagemagick'
brew 'ghostscript'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-meslo-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
